In [1]:
import pandas as pd
import numpy as np
import requests
import json

In [2]:
df = pd.read_csv('data.csv')

### Convert API Call to Pandas DataFrame

In [3]:
r1 = requests.get('https://jsonplaceholder.typicode.com/posts').json()
df001 = pd.DataFrame(r1)
df001.head(2)

#or,

#r = requests.get('https://jsonplaceholder.typicode.com/posts/1').json()
# data = pd.DataFrame(r, index=[0])

#Note: We have to set index if we are passing a single scalar value for the columns.

,userId,id,title,body
0,1,1,sunt aut facere repellat provident occaecati e...,quia et suscipit\nsuscipit recusandae consequu...
1,1,2,qui est esse,est rerum tempore vitae\nsequi sint nihil repr...

In [4]:
r2 = requests.get('https://openlibrary.org/api/volumes/brief/isbn/9780525440987.json')#.json()
df002 = pd.DataFrame(r2)
df002.head(2)

                                                   0
0  b'{"records": {"/books/OL2842220M": {"isbns": ...
1  b'7711"], "olids": ["OL2842220M"], "publishDat...

# Pandas - Analyzing DataFrames
## 1. Viewing Data
View the top rows of the frame\
View the bottom rows of the frame\
View basic statistical details\
Convert the pandas DataFrame to numpy Array\
Convert the pandas Series to numpy Array\
Convert series or dataframe object to Numpy-array using .as_matrix().

In [5]:
# To view complete DataFrame: to_string()

print(df.to_string())

    Duration  Pulse  Maxpulse  Calories
0         60  110.0       130     409.1
1         50  117.0       145     479.0
2         60  103.0       135     340.0
3         45  109.0       175       NaN
4         45  117.0       148     406.0
5         60  102.0       127     300.0
6         60    NaN       136     374.0
7         45  104.0       134     253.3
8         30  109.0       133       NaN
9         60   98.0       124     269.0
10        65  103.0       147     329.3
11        60  100.0       120     250.7
12        70  106.0       128     345.3
13        60  104.0       132     379.3
14        60   98.0       123     275.0
15        80   98.0       120     215.2
16        60  100.0       120     300.0
17        45   90.0       112       NaN
18        60  103.0       123     323.0
19        45   97.0       125     243.0
20        60  108.0       131     364.2
21        45  100.0       119     282.0
22        60  130.0       101     300.0
23        45  105.0       132     246.0
24        45  100.0       119     282.0

In [6]:
# To view sample rows from dataframe

df.sample(n=5)

    Duration  Pulse  Maxpulse  Calories
4         45  117.0       148     406.0
10        65  103.0       147     329.3
20        60  108.0       131     364.2
14        60   98.0       123     275.0
9         60   98.0       124     269.0

In [7]:
# Top rows (5 by default):

df.head()

   Duration  Pulse  Maxpulse  Calories
0        60  110.0       130     409.1
1        50  117.0       145     479.0
2        60  103.0       135     340.0
3        45  109.0       175       NaN
4        45  117.0       148     406.0

In [8]:
df.head(2)

   Duration  Pulse  Maxpulse  Calories
0        60  110.0       130     409.1
1        50  117.0       145     479.0

In [9]:
# Bottom rows (5 by default):
df.tail()

    Duration  Pulse  Maxpulse  Calories
20        60  108.0       131     364.2
21        45  100.0       119     282.0
22        60  130.0       101     300.0
23        45  105.0       132     246.0
24        45  100.0       119     282.0

In [10]:
# It will give 2 rows with largest/maximum values in "Calories" column
df.nlargest(2,'Calories')

   Duration  Pulse  Maxpulse  Calories
1        50  117.0       145     479.0
0        60  110.0       130     409.1

In [11]:
df.nsmallest(2,'Calories')

    Duration  Pulse  Maxpulse  Calories
15        80   98.0       120     215.2
19        45   97.0       125     243.0

In [12]:
# Information of Structure of a DataFrame:

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  25 non-null     int64
 1   Pulse     24 non-null     float64
 2   Maxpulse  25 non-null     int64
 3   Calories  22 non-null     float64
dtypes: float64(2), int64(2)
memory usage: 928.0 bytes

In [13]:
# To view some basic statistical details of DataFrame/Series:

df.describe()

        Duration       Pulse    Maxpulse    Calories
count  25.000000   24.000000   25.000000   22.000000
mean   55.000000  104.625000  129.560000  316.609091
std    10.606602    8.171065   14.189433   65.551862
min    30.000000   90.000000  101.000000  215.200000
25%    45.000000  100.000000  120.000000  270.500000
50%    60.000000  103.000000  128.000000  300.000000
75%    60.000000  108.250000  134.000000  359.475000
max    80.000000  130.000000  175.000000  479.000000

In [14]:
df.describe().T

          count        mean        std    min    25%    50%      75%    max
Duration   25.0   55.000000  10.606602   30.0   45.0   60.0   60.000   80.0
Pulse      24.0  104.625000   8.171065   90.0  100.0  103.0  108.250  130.0
Maxpulse   25.0  129.560000  14.189433  101.0  120.0  128.0  134.000  175.0
Calories   22.0  316.609091  65.551862  215.2  270.5  300.0  359.475  479.0

### Pandas Dataframe.to_numpy() – Convert dataframe to Numpy array

In [15]:
d_f = pd.DataFrame(
[[1, 2, 3],
[4, 5, 6],
[7, 8, 9],
[10, 11, 12]],
columns=['a', 'b', 'c'])

# convert dataframe to numpy array
arr = d_f.to_numpy()

print(arr)
print(type(arr))

[[ 1  2  3]
 [ 4  5  6]
 [ 7  8  9]
 [10 11 12]]
<class 'numpy.ndarray'>

In [16]:
 #convert a particular column into numpy array.
arr = d_f[['a', 'c']].to_numpy()
 
print(arr)
print(type(arr))

[[ 1  3]
 [ 4  6]
 [ 7  9]
 [10 12]]
<class 'numpy.ndarray'>

##### Here, we are using a CSV file for changing the Dataframe into a Numpy array by using the method DataFrame.to_numpy().

In [17]:
# reading the csv
data = pd.read_csv("nba.csv")

# creating DataFrame from weight column
dfw = pd.DataFrame(data['Weight'].head())

# using to_numpy() function
print(dfw.to_numpy())

[[180.]
 [235.]
 [205.]
 [185.]
 [231.]]

### Pandas Series.to_numpy()

In [18]:
 # reading the csv  
data = pd.read_csv("nba.csv") 
  
# creating series form weight column
gfg = pd.Series(data['Weight'].head())
gfg

0    180.0
1    235.0
2    205.0
3    185.0
4    231.0
Name: Weight, dtype: float64

In [19]:
# using to_numpy() function
print(gfg.to_numpy())
print(type(gfg.to_numpy()))

[180. 235. 205. 185. 231.]
<class 'numpy.ndarray'>

### Pandas Series.as_matrix()
https://www.geeksforgeeks.org/python-pandas-series-as_matrix/

### To find total rows & columns in DataFrame:

In [20]:
df.shape

(25, 4)

### To find size (rows x colums) of a DataFrame:

In [21]:
df.size

100

### Distinct Values

In [22]:
# To get number of distinct/unique values for all columns:

df.nunique()

Duration     7
Pulse       14
Maxpulse    20
Calories    19
dtype: int64

In [23]:
# To get number of unique values for column 'Duration':
# Here 'dropna=True' will drop the null values means null value will not include in calcalution of unique.

df.Duration.nunique(dropna = True)

7

In [24]:
# To print all unique (values) for all column 'Duration':

df.Duration.unique()

array([60, 50, 45, 30, 65, 70, 80])

In [25]:
df.Duration.nunique()

7

### Null Values (Empty Cells)

In [26]:
# It will show True or False if any columns has null values

df.isna().any()

Duration    False
Pulse        True
Maxpulse    False
Calories     True
dtype: bool

In [27]:
# Total summation of all null (missing) values of all columns in the DataFrame:

df.isnull().sum()

Duration    0
Pulse       1
Maxpulse    0
Calories    3
dtype: int64

In [28]:
# Total summation of all missing values in the DataFrame 

df.isnull().sum().sum()

4

In [29]:
# To print (check) null value in DataFrame:

df[df.isnull().any(axis=1)]

    Duration  Pulse  Maxpulse  Calories
3         45  109.0       175       NaN
6         60    NaN       136     374.0
8         30  109.0       133       NaN
17        45   90.0       112       NaN

### Pandas - Cleaning Empty Cells
way to deal with empty cells:
1. Remove Rows
2. Replace Empty Values
3. Replace Using Mean, Median, or Mode

##### 1. Remove Rows

In [30]:
# Return a new Data Frame with no empty cells:

new_df = df.dropna()

print(new_df.to_string())

    Duration  Pulse  Maxpulse  Calories
0         60  110.0       130     409.1
1         50  117.0       145     479.0
2         60  103.0       135     340.0
4         45  117.0       148     406.0
5         60  102.0       127     300.0
7         45  104.0       134     253.3
9         60   98.0       124     269.0
10        65  103.0       147     329.3
11        60  100.0       120     250.7
12        70  106.0       128     345.3
13        60  104.0       132     379.3
14        60   98.0       123     275.0
15        80   98.0       120     215.2
16        60  100.0       120     300.0
18        60  103.0       123     323.0
19        45   97.0       125     243.0
20        60  108.0       131     364.2
21        45  100.0       119     282.0
22        60  130.0       101     300.0
23        45  105.0       132     246.0
24        45  100.0       119     282.0

Note: By default, the dropna() method returns a new DataFrame, and will not change the original.

If you want to change the original DataFrame, use the inplace = True argument:

In [31]:
# df.dropna(inplace = True)

##### 2. Replace Empty Values
The fillna() method allows us to replace empty cells with a value:

In [32]:
# df.fillna(130, inplace = True)

Replace Only For Specified Columns:\
The example above replaces all empty cells in the whole Data Frame.\
To only replace empty values for one column, specify the column name for the DataFrame:

In [33]:
# Example
# Replace NULL values in the "Calories" columns with the number 130:
df2 = pd.read_csv('data.csv')
df2["Calories"].fillna(130, inplace = True)
df2

    Duration  Pulse  Maxpulse  Calories
0         60  110.0       130     409.1
1         50  117.0       145     479.0
2         60  103.0       135     340.0
3         45  109.0       175     130.0
4         45  117.0       148     406.0
5         60  102.0       127     300.0
6         60    NaN       136     374.0
7         45  104.0       134     253.3
8         30  109.0       133     130.0
9         60   98.0       124     269.0
10        65  103.0       147     329.3
11        60  100.0       120     250.7
12        70  106.0       128     345.3
13        60  104.0       132     379.3
14        60   98.0       123     275.0
15        80   98.0       120     215.2
16        60  100.0       120     300.0
17        45   90.0       112     130.0
18        60  103.0       123     323.0
19        45   97.0       125     243.0
20        60  108.0       131     364.2
21        45  100.0       119     282.0
22        60  130.0       101     300.0
23        45  105.0       132     246.0
24        45  100.0       119     282.0

##### 3. Replace Using Mean, Median, or Mode
A common way to replace empty cells, is to calculate the mean, median or mode value of the column.

Pandas uses the mean() median() and mode() methods to calculate the respective values for a specified column:

In [34]:
x = df["Calories"].mean() #median()/mode()

x

316.60909090909087

In [35]:
df3 = pd.read_csv('data.csv')

df3["Calories"].fillna(x, inplace = True)
df3

    Duration  Pulse  Maxpulse    Calories
0         60  110.0       130  409.100000
1         50  117.0       145  479.000000
2         60  103.0       135  340.000000
3         45  109.0       175  316.609091
4         45  117.0       148  406.000000
5         60  102.0       127  300.000000
6         60    NaN       136  374.000000
7         45  104.0       134  253.300000
8         30  109.0       133  316.609091
9         60   98.0       124  269.000000
10        65  103.0       147  329.300000
11        60  100.0       120  250.700000
12        70  106.0       128  345.300000
13        60  104.0       132  379.300000
14        60   98.0       123  275.000000
15        80   98.0       120  215.200000
16        60  100.0       120  300.000000
17        45   90.0       112  316.609091
18        60  103.0       123  323.000000
19        45   97.0       125  243.000000
20        60  108.0       131  364.200000
21        45  100.0       119  282.000000
22        60  130.0       101  300.000000
23        45  105.0       132  246.000000
24        45  100.0       119  282.000000

### Duplicates

#### Finding duplicate rows in a DataFrame

In [36]:
duplicates = df[df.duplicated()]
duplicates

    Duration  Pulse  Maxpulse  Calories
24        45  100.0       119     282.0

#### Finding duplicates on selected columns

In [37]:
# Alternates:>
#1. duplicate = df[df.duplicated('Calories')]
#2. duplicate = df[df['Calories'].duplicated()]

duplicate = df[df.Calories.duplicated()] 
duplicate

    Duration  Pulse  Maxpulse  Calories
8         30  109.0       133       NaN
16        60  100.0       120     300.0
17        45   90.0       112       NaN
22        60  130.0       101     300.0
24        45  100.0       119     282.0

Here, we can see the all rows where 'Calories' is duplicated (repeated).

#### Remove all duplicates:

In [38]:
# Note: If you want to change the original DataFrame, use the <inplace = True argument>
# >>> df.drop_duplicates(inplace = True)

df.drop_duplicates()
df

    Duration  Pulse  Maxpulse  Calories
0         60  110.0       130     409.1
1         50  117.0       145     479.0
2         60  103.0       135     340.0
3         45  109.0       175       NaN
4         45  117.0       148     406.0
5         60  102.0       127     300.0
6         60    NaN       136     374.0
7         45  104.0       134     253.3
8         30  109.0       133       NaN
9         60   98.0       124     269.0
10        65  103.0       147     329.3
11        60  100.0       120     250.7
12        70  106.0       128     345.3
13        60  104.0       132     379.3
14        60   98.0       123     275.0
15        80   98.0       120     215.2
16        60  100.0       120     300.0
17        45   90.0       112       NaN
18        60  103.0       123     323.0
19        45   97.0       125     243.0
20        60  108.0       131     364.2
21        45  100.0       119     282.0
22        60  130.0       101     300.0
23        45  105.0       132     246.0
24        45  100.0       119     282.0

## 2. Selection
Dealing with Rows and Columns in Pandas DataFrame\
How to select multiple columns in a pandas dataframe\
Python | Pandas Extracting rows using .loc[]\
Python | Extracting rows using Pandas .iloc[]\
Indexing and Selecting Data with Pandas\
Boolean Indexing in Pandas\
Label and Integer based slicing technique using DataFrame.ix[ ]

### Dealing with Columns
In order to deal with columns, we perform basic operations on columns like selecting, deleting, adding and renaming.

In [39]:
df.head(2)

   Duration  Pulse  Maxpulse  Calories
0        60  110.0       130     409.1
1        50  117.0       145     479.0

In [40]:
df['Duration'].head(2)

0    60
1    50
Name: Duration, dtype: int64

In [41]:
df[['Duration']].head(2)

   Duration
0        60
1        50

In [42]:
df[['Duration','Pulse']].head(2)

   Duration  Pulse
0        60  110.0
1        50  117.0

### Dealing with Rows
In order to deal with rows, we can perform basic operations on rows like selecting, deleting, adding and renaming.

##### Extracting rows using Pandas .loc[]

In [43]:
df[0:5]

   Duration  Pulse  Maxpulse  Calories
0        60  110.0       130     409.1
1        50  117.0       145     479.0
2        60  103.0       135     340.0
3        45  109.0       175       NaN
4        45  117.0       148     406.0

In [44]:
df.loc[0:4, ["Duration", "Calories"]]

   Duration  Calories
0        60     409.1
1        50     479.0
2        60     340.0
3        45       NaN
4        45     406.0

In [45]:
df.iloc[0:5, [2,3]]

   Maxpulse  Calories
0       130     409.1
1       145     479.0
2       135     340.0
3       175       NaN
4       148     406.0

In [46]:
row1 = df.loc[0]
row1

Duration     60.0
Pulse       110.0
Maxpulse    130.0
Calories    409.1
Name: 0, dtype: float64

##### Extracting rows using Pandas .iloc[]

In [47]:
row1 = df.iloc[0]
row1

Duration     60.0
Pulse       110.0
Maxpulse    130.0
Calories    409.1
Name: 0, dtype: float64

In [48]:
row3 = df.iloc[[0, 1, 2, 3]]
 
row4 = df.iloc[0:4]

print(row3,"\n\n",row4)

   Duration  Pulse  Maxpulse  Calories
0        60  110.0       130     409.1
1        50  117.0       145     479.0
2        60  103.0       135     340.0
3        45  109.0       175       NaN

    Duration  Pulse  Maxpulse  Calories
0        60  110.0       130     409.1
1        50  117.0       145     479.0
2        60  103.0       135     340.0
3        45  109.0       175       NaN

##### Indexing and Selecting Data with Pandas
https://www.geeksforgeeks.org/indexing-and-selecting-data-with-pandas/

## 3. Manipulating Data
Adding new column to existing DataFrame in Pandas\
Delete rows/columns from DataFrame\
Truncate a DataFrame before and after some index value\
Truncate a Series before and after some index value\
Iterating over rows and columns in Pandas DataFrame\
Working with Missing Data in Pandas\
Sorts a data frame in Pandas | Set-1\
Sorts a data frame in Pandas | Set-2

### 1. Adding new column to existing DataFrame in Pandas
https://www.geeksforgeeks.org/adding-new-column-to-existing-dataframe-in-pandas/

#### Method #1: By declaring a new list as a column.

In [49]:
# Import pandas package
import pandas as pd

# Define a dictionary containing Students data
data = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
		'Height': [5.1, 6.2, 5.1, 5.2],
		'Qualification': ['Msc', 'MA', 'Msc', 'Msc']}

# Convert the dictionary into DataFrame
df1 = pd.DataFrame(data)

# Declare a list that is to be converted into a column
address = ['Delhi', 'Bangalore', 'Chennai', 'Patna']

# Using 'Address' as the column name and equating it to the list
df1['Address'] = address

# Observe the result
print(df1)

     Name  Height Qualification    Address
0     Jai     5.1           Msc      Delhi
1  Princi     6.2            MA  Bangalore
2  Gaurav     5.1           Msc    Chennai
3    Anuj     5.2           Msc      Patna

#### Creating copy of DataFrame

In [50]:
df1_copy = df1.copy()
df1_copy

     Name  Height Qualification    Address
0     Jai     5.1           Msc      Delhi
1  Princi     6.2            MA  Bangalore
2  Gaurav     5.1           Msc    Chennai
3    Anuj     5.2           Msc      Patna

In [51]:
df1_copy['Salary'] = [2000, 3000, 4000, 5000] 
df1_copy

     Name  Height Qualification    Address  Salary
0     Jai     5.1           Msc      Delhi    2000
1  Princi     6.2            MA  Bangalore    3000
2  Gaurav     5.1           Msc    Chennai    4000
3    Anuj     5.2           Msc      Patna    5000

#### Method #2: By using DataFrame.insert()

It gives the freedom to add a column at any position we like and not just at the end. It also provides different options for inserting the column values.

In [52]:
copy1 = df1.copy()
copy1

     Name  Height Qualification    Address
0     Jai     5.1           Msc      Delhi
1  Princi     6.2            MA  Bangalore
2  Gaurav     5.1           Msc    Chennai
3    Anuj     5.2           Msc      Patna

In [53]:
copy1.insert(2, "Salary", [2000, 3000, 4000, 5000], True)
copy1

     Name  Height  Salary Qualification    Address
0     Jai     5.1    2000           Msc      Delhi
1  Princi     6.2    3000            MA  Bangalore
2  Gaurav     5.1    4000           Msc    Chennai
3    Anuj     5.2    5000           Msc      Patna

#### Method #3: Using Dataframe.assign() method

This method will create a new dataframe with a new column added to the old dataframe.

In [54]:
# # Define a dictionary containing Students data
# data = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
# 		'Height': [5.1, 6.2, 5.1, 5.2],
# 		'Qualification': ['Msc', 'MA', 'Msc', 'Msc']}


# # Convert the dictionary into DataFrame
# df2 = pd.DataFrame(data)

# # Using 'Address' as the column name and equating it to the list
# df2 = df.assign(address=['Delhi', 'Bangalore', 'Chennai', 'Patna'])

# # Observe the result
# print(df2)

### 2. Delete rows/columns from DataFrame using Pandas.drop()
https://www.geeksforgeeks.org/python-delete-rows-columns-from-dataframe-using-pandas-drop/

##### Example #1: Dropping Rows by index label
In his code, A list of index labels is passed and the rows corresponding to those labels are dropped using .drop() method.

In [55]:
nba = pd.read_csv('nba.csv', index_col = 'Name')
nba

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...
Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [56]:
nba.drop(['Avery Bradley', 'John Holland'])

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
...,...,...,...,...,...,...,...,...
Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

##### Example #2 : Dropping columns with column name

In his code, Passed columns are dropped using column names. axis parameter is kept 1 since 1 refers to columns.

In [57]:
nba.drop(["Team", "Weight"], axis = 1).head() 

#Note; here 1 for column & we can use (inplace = True) for permanent change in nba df

               Number Position   Age Height            College     Salary
Name
Avery Bradley     0.0       PG  25.0    6-2              Texas  7730337.0
Jae Crowder      99.0       SF  25.0    6-6          Marquette  6796117.0
John Holland     30.0       SG  27.0    6-5  Boston University        NaN
R.J. Hunter      28.0       SG  22.0    6-5      Georgia State  1148640.0
Jonas Jerebko     8.0       PF  29.0   6-10                NaN  5000000.0

In [58]:
nba.drop(["College", "Position"], axis = 1).head()

                         Team  Number   Age Height  Weight     Salary
Name
Avery Bradley  Boston Celtics     0.0  25.0    6-2   180.0  7730337.0
Jae Crowder    Boston Celtics    99.0  25.0    6-6   235.0  6796117.0
John Holland   Boston Celtics    30.0  27.0    6-5   205.0        NaN
R.J. Hunter    Boston Celtics    28.0  22.0    6-5   185.0  1148640.0
Jonas Jerebko  Boston Celtics     8.0  29.0   6-10   231.0  5000000.0

### 3. Pandas DataFrame.truncate
Pandas DataFrame.truncate() function is used to truncate a Series or DataFrame before and after some index value.
https://www.geeksforgeeks.org/python-pandas-dataframe-truncate/

##### Example #1: 
Use DataFrame.truncate() function to truncate some entries before and after the passed labels of the given dataframe.

In [59]:
# Creating the DataFrame
df11 = pd.DataFrame({'Name':['Sam', 'Andrea', 'Alex', 'Robin', 'Kia'],
                   'Weight':[45, 88, 56, 15, 71],    
                    'Age':[14, 25, 55, 8, 21]})

# Create the index
index_ = pd.date_range('2010-10-09 08:45', periods = 5, freq ='H')

# Set the index
df11.index = index_

# Print the DataFrame
df11

                       Name  Weight  Age
2010-10-09 08:45:00     Sam      45   14
2010-10-09 09:45:00  Andrea      88   25
2010-10-09 10:45:00    Alex      56   55
2010-10-09 11:45:00   Robin      15    8
2010-10-09 12:45:00     Kia      71   21

In [60]:
# return the truncated dataframe
df11.truncate(before = '2010-10-09 09:45:00', after = '2010-10-09 11:45:00')

                       Name  Weight  Age
2010-10-09 09:45:00  Andrea      88   25
2010-10-09 10:45:00    Alex      56   55
2010-10-09 11:45:00   Robin      15    8

#####  Example #2: 
Use DataFrame.truncate() function to truncate some entries before and after the passed labels of the given dataframe.

In [61]:
# Creating the DataFrame
df12 = pd.DataFrame({"A":[12, 4, 5, None, 1],
				    "B":[7, 2, 54, 3, None],
				    "C":[20, 16, 11, 3, 8],
				    "D":[14, 3, None, 2, 6]})

# Create the index
index_ = ['Row_1', 'Row_2', 'Row_3', 'Row_4', 'Row_5']

# Set the index
df12.index = index_

# Print the DataFrame
df12

          A     B   C     D
Row_1  12.0   7.0  20  14.0
Row_2   4.0   2.0  16   3.0
Row_3   5.0  54.0  11   NaN
Row_4   NaN   3.0   3   2.0
Row_5   1.0   NaN   8   6.0

In [62]:
df12.truncate(before = 'Row_3', after = 'Row_4')

         A     B   C    D
Row_3  5.0  54.0  11  NaN
Row_4  NaN   3.0   3  2.0

In [63]:
# Creating the Series
sr = pd.Series([19.5, 16.8, 22.78, 20.124, 18.1002])
sr

0    19.5000
1    16.8000
2    22.7800
3    20.1240
4    18.1002
dtype: float64

In [64]:
sr.truncate(before=1, after=3)

1    16.800
2    22.780
3    20.124
dtype: float64

### 4. Iterating over rows and columns in Pandas DataFrame

## 4. Pandas: Grouping Data <groupby()>
Pandas GroupBy\
Grouping Rows in pandas\
Combining multiple columns in Pandas groupby with dictionary

In [65]:
# Example
# Find the average co2 consumption for each car brand:

data = {
  'co2': [95, 90, 99, 104, 105, 94, 99, 104],
  'model': ['Citigo', 'Fabia', 'Fiesta', 'Rapid', 'Focus', 'Mondeo', 'Octavia', 'B-Max'],
  'car': ['Skoda', 'Skoda', 'Ford', 'Skoda', 'Ford', 'Ford', 'Skoda', 'Ford']
}

df13 = pd.DataFrame(data)

print(df13.groupby(["car"]).mean())

         co2
car
Ford   100.5
Skoda   97.0

In [66]:
df13.groupby('car').count()                  # df1.groupby(['car']).count()

       co2  model
car
Ford     4      4
Skoda    4      4

In [ ]:
df13.groupby('car').count().reset_index()

In [67]:
df13.groupby('car')['co2'].count()

car
Ford     4
Skoda    4
Name: co2, dtype: int64

In [68]:
df.head()

   Duration  Pulse  Maxpulse  Calories
0        60  110.0       130     409.1
1        50  117.0       145     479.0
2        60  103.0       135     340.0
3        45  109.0       175       NaN
4        45  117.0       148     406.0

In [69]:
df.groupby('Duration').count()

          Pulse  Maxpulse  Calories
Duration
30            1         1         0
45            8         8         6
50            1         1         1
60           11        12        12
65            1         1         1
70            1         1         1
80            1         1         1

In [70]:
df.groupby(['Duration'])['Pulse'].count()

Duration
30     1
45     8
50     1
60    11
65     1
70     1
80     1
Name: Pulse, dtype: int64

In [71]:
# Define a dictionary containing employee data
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi','Gaurav', 'Anuj', 'Princi', 'Abhi'],
        'Age':[27, 24, 22, 32, 33, 36, 27, 32],
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj','Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd','B.Tech', 'B.com', 'Msc', 'MA'],
        'Score': [23, 34, 35, 45, 47, 50, 52, 53]}

# Convert the dictionary into DataFrame
dt = pd.DataFrame(data1)
dt

     Name  Age    Address Qualification  Score
0     Jai   27     Nagpur           Msc     23
1    Anuj   24     Kanpur            MA     34
2     Jai   22  Allahabad           MCA     35
3  Princi   32    Kannuaj           Phd     45
4  Gaurav   33    Jaunpur        B.Tech     47
5    Anuj   36     Kanpur         B.com     50
6  Princi   27  Allahabad           Msc     52
7    Abhi   32    Aligarh            MA     53

In [72]:
# Now we group a data of Name using groupby() function. 
grp = dt.groupby('Name')

# To print groups that created.
grp.groups    # dt.groupby('Name').groups or print(dt.groupby('Name').groups)

{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2], 'Princi': [3, 6]}

### Grouping data with one key:
In order to group data with one key, we pass only one key as an argument in groupby function.

In [73]:
grp = dt.groupby('Name')

In [74]:
# Let's print the first entries in all the groups formed.
grp.first()

        Age  Address Qualification  Score
Name
Abhi     32  Aligarh            MA     53
Anuj     24   Kanpur            MA     34
Gaurav   33  Jaunpur        B.Tech     47
Jai      27   Nagpur           Msc     23
Princi   32  Kannuaj           Phd     45

### Grouping data with multiple keys: 
In order to group data with multiple keys, we pass multiple keys in groupby function.

In [75]:
grp1 = dt.groupby(['Name', 'Qualification'])

In [76]:
grp1.groups

{('Abhi', 'MA'): [7], ('Anuj', 'B.com'): [5], ('Anuj', 'MA'): [1], ('Gaurav', 'B.Tech'): [4], ('Jai', 'MCA'): [2], ('Jai', 'Msc'): [0], ('Princi', 'Msc'): [6], ('Princi', 'Phd'): [3]}

### Iterating through groups
In order to iterate an element of groups, we can iterate through the object similar to itertools.obj.

In [77]:
dt

     Name  Age    Address Qualification  Score
0     Jai   27     Nagpur           Msc     23
1    Anuj   24     Kanpur            MA     34
2     Jai   22  Allahabad           MCA     35
3  Princi   32    Kannuaj           Phd     45
4  Gaurav   33    Jaunpur        B.Tech     47
5    Anuj   36     Kanpur         B.com     50
6  Princi   27  Allahabad           Msc     52
7    Abhi   32    Aligarh            MA     53

In [78]:
# iterating an element of group
 
grp = dt.groupby('Name')
for name, group in grp:
    print(name)
    print(group)
    print()                  # used for gap in b/w

Abhi
   Name  Age  Address Qualification  Score
7  Abhi   32  Aligarh            MA     53

Anuj
   Name  Age Address Qualification  Score
1  Anuj   24  Kanpur            MA     34
5  Anuj   36  Kanpur         B.com     50

Gaurav
     Name  Age  Address Qualification  Score
4  Gaurav   33  Jaunpur        B.Tech     47

Jai
  Name  Age    Address Qualification  Score
0  Jai   27     Nagpur           Msc     23
2  Jai   22  Allahabad           MCA     35

Princi
     Name  Age    Address Qualification  Score
3  Princi   32    Kannuaj           Phd     45
6  Princi   27  Allahabad           Msc     52

In [79]:
# iterating an element of group containing multiple keys
 
grp1 = dt.groupby(['Name', 'Qualification'])
for name, group in grp1:
    print(name)
    print(group)
    print()

('Abhi', 'MA')
   Name  Age  Address Qualification  Score
7  Abhi   32  Aligarh            MA     53

('Anuj', 'B.com')
   Name  Age Address Qualification  Score
5  Anuj   36  Kanpur         B.com     50

('Anuj', 'MA')
   Name  Age Address Qualification  Score
1  Anuj   24  Kanpur            MA     34

('Gaurav', 'B.Tech')
     Name  Age  Address Qualification  Score
4  Gaurav   33  Jaunpur        B.Tech     47

('Jai', 'MCA')
  Name  Age    Address Qualification  Score
2  Jai   22  Allahabad           MCA     35

('Jai', 'Msc')
  Name  Age Address Qualification  Score
0  Jai   27  Nagpur           Msc     23

('Princi', 'Msc')
     Name  Age    Address Qualification  Score
6  Princi   27  Allahabad           Msc     52

('Princi', 'Phd')
     Name  Age  Address Qualification  Score
3  Princi   32  Kannuaj           Phd     45

### Selecting a groups
In order to select a group, we can select group using GroupBy.get_group(). We can select a group by applying a function GroupBy.get_group this function select a single group.

In [80]:
grp.groups

{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2], 'Princi': [3, 6]}

In [81]:
grp1.groups

{('Abhi', 'MA'): [7], ('Anuj', 'B.com'): [5], ('Anuj', 'MA'): [1], ('Gaurav', 'B.Tech'): [4], ('Jai', 'MCA'): [2], ('Jai', 'Msc'): [0], ('Princi', 'Msc'): [6], ('Princi', 'Phd'): [3]}

In [82]:
# selecting a single group

grp.get_group('Jai')

  Name  Age    Address Qualification  Score
0  Jai   27     Nagpur           Msc     23
2  Jai   22  Allahabad           MCA     35

In [83]:
# selecting object grouped on multiple columns

grp1.get_group(('Gaurav', 'B.Tech'))

     Name  Age  Address Qualification  Score
4  Gaurav   33  Jaunpur        B.Tech     47

### Applying function to group
##### After splitting a data into a group, we apply a function to each group in order to do that we perform some operation they are: 
 

Aggregation : It is a process in which we compute a summary statistic (or statistics) about each group.
For Example, Compute group sums or means

Transformation : It is a process in which we perform some group-specific computations and return a like-indexed. For Example, Filling NAs within groups with a value derived from each group

Filtration : It is a process in which we discard some groups, according to a group-wise computation that evaluates True or False.\
For Example, Filtering out data based on the group sum or mean

https://www.geeksforgeeks.org/pandas-groupby/

#### Aggregation

In [84]:
# need to import numpy if you do aggregation on group like below:
import numpy as np

grp.aggregate(np.sum)

        Age  Score
Name
Abhi     32     53
Anuj     60     84
Gaurav   33     47
Jai      49     58
Princi   59     97

In [85]:
grp.sum()

        Age  Score
Name
Abhi     32     53
Anuj     60     84
Gaurav   33     47
Jai      49     58
Princi   59     97

In [86]:
grp1.sum()

                      Age  Score
Name   Qualification
Abhi   MA              32     53
Anuj   B.com           36     50
       MA              24     34
Gaurav B.Tech          33     47
Jai    MCA             22     35
       Msc             27     23
Princi Msc             27     52
       Phd             32     45

In [87]:
agg_sum = dt.groupby('Name').sum()
agg_sum

        Age  Score
Name
Abhi     32     53
Anuj     60     84
Gaurav   33     47
Jai      49     58
Princi   59     97

##### Applying multiple functions at once : 
We can apply a multiple functions at once by passing a list or dictionary of functions to do aggregation with, outputting a DataFrame.

In [88]:
# applying a function by passing a list of functions
 
grp = dt.groupby('Name')
 
grp['Age'].agg([np.sum, np.mean, np.std])

        sum  mean       std
Name
Abhi     32  32.0       NaN
Anuj     60  30.0  8.485281
Gaurav   33  33.0       NaN
Jai      49  24.5  3.535534
Princi   59  29.5  3.535534

In [89]:
grp['Age'].sum()

Name
Abhi      32
Anuj      60
Gaurav    33
Jai       49
Princi    59
Name: Age, dtype: int64

In [90]:
grp['Age'].mean()

Name
Abhi      32.0
Anuj      30.0
Gaurav    33.0
Jai       24.5
Princi    29.5
Name: Age, dtype: float64

##### Applying different functions to DataFrame columns : 
In order to apply a different aggregation to the columns of a DataFrame, we can pass a dictionary to aggregate .

In [91]:
dt

     Name  Age    Address Qualification  Score
0     Jai   27     Nagpur           Msc     23
1    Anuj   24     Kanpur            MA     34
2     Jai   22  Allahabad           MCA     35
3  Princi   32    Kannuaj           Phd     45
4  Gaurav   33    Jaunpur        B.Tech     47
5    Anuj   36     Kanpur         B.com     50
6  Princi   27  Allahabad           Msc     52
7    Abhi   32    Aligarh            MA     53

In [92]:
# using different aggregation function by passing dictionary to aggregate
grp = dt.groupby('Name')
 
grp.agg({'Age' : 'sum', 'Score' : 'mean'})

        Age  Score
Name
Abhi     32   53.0
Anuj     60   42.0
Gaurav   33   47.0
Jai      49   29.0
Princi   59   48.5

### Grouping Rows in pandas

In [93]:
# example dataframe
import pandas as pd
example = {'Team':['Arsenal', 'Manchester United', 'Arsenal',
                   'Arsenal', 'Chelsea', 'Manchester United',
                   'Manchester United', 'Chelsea', 'Chelsea', 'Chelsea'],
                     
           'Player':['Ozil', 'Pogba', 'Lucas', 'Aubameyang',
                       'Hazard', 'Mata', 'Lukaku', 'Morata', 
                                         'Giroud', 'Kante'],
                                           
           'Goals':[5, 3, 6, 4, 9, 2, 0, 5, 2, 3] }
  
pl = pd.DataFrame(example)
  
print(pl)

                Team      Player  Goals
0            Arsenal        Ozil      5
1  Manchester United       Pogba      3
2            Arsenal       Lucas      6
3            Arsenal  Aubameyang      4
4            Chelsea      Hazard      9
5  Manchester United        Mata      2
6  Manchester United      Lukaku      0
7            Chelsea      Morata      5
8            Chelsea      Giroud      2
9            Chelsea       Kante      3

In [94]:
total_goals = pl['Goals'].groupby(pl['Team'])
  
# printing the means value
total_goals.mean()

Team
Arsenal              5.000000
Chelsea              4.750000
Manchester United    1.666667
Name: Goals, dtype: float64

OR

In [95]:
total_goals = pl.groupby('Team')
total_goals.mean()

                      Goals
Team
Arsenal            5.000000
Chelsea            4.750000
Manchester United  1.666667

### Combining multiple columns in Pandas groupby with dictionary 
https://www.geeksforgeeks.org/combining-multiple-columns-in-pandas-groupby-with-dictionary/

## 5. Merging, Joining and Concatenating
https://www.geeksforgeeks.org/python-pandas-merging-joining-and-concatenating/

### 1. Concatenating DataFrame
we use concat() function which helps in concatenating a dataframe. We can concat a dataframe in many different ways, they are:

Concatenating DataFrame using .concat()\
Concatenating DataFrame by setting logic on axes\
Concatenating DataFrame using .append()\
Concatenating DataFrame by ignoring indexes\
Concatenating DataFrame with group keys\
Concatenating with mixed ndims

#### Concatenating DataFrame using .concat() :
In order to concat a dataframe, we use .concat() function this function concat a dataframe and returns a new dataframe.

In [96]:
# importing pandas module
import pandas as pd 
 
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 
   
# Define a dictionary containing employee data 
data2 = {'Name':['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'], 
        'Age':[17, 14, 12, 52], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']} 
 
# Convert the dictionary into DataFrame  
cd = pd.DataFrame(data1,index=[0, 1, 2, 3])
 
# Convert the dictionary into DataFrame  
cd1 = pd.DataFrame(data2, index=[4, 5, 6, 7])
 
print(cd, "\n\n", cd1)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd

      Name  Age    Address Qualification
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons

In [97]:
# using a .concat() method
frames = [cd, cd1]
 
res1 = pd.concat(frames)   # pd.concat([cd,cd1])
res1

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons

#### Concatenating DataFrame by setting logic on axes :
In order to concat dataframe, we have to set different logic on axes. We can set axes in the following three ways:

Taking the union of them all, join='outer'. This is the default option as it results in zero information loss.\
Taking the intersection, join='inner'.\
Use a specific index, as passed to the join_axes argument

In [98]:
# importing pandas module
import pandas as pd 
 
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd'],
        'Mobile No': [97, 91, 58, 76]} 
   
# Define a dictionary containing employee data 
data2 = {'Name':['Gaurav', 'Anuj', 'Dhiraj', 'Hitesh'], 
        'Age':[22, 32, 12, 52], 
        'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'], 
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons'],
        'Salary':[1000, 2000, 3000, 4000]} 
 
# Convert the dictionary into DataFrame  
dff = pd.DataFrame(data1,index=[0, 1, 2, 3])
 
# Convert the dictionary into DataFrame  
dff1 = pd.DataFrame(data2, index=[2, 3, 6, 7]) 
 
print(dff, "\n\n", dff1)

     Name  Age    Address Qualification  Mobile No
0     Jai   27     Nagpur           Msc         97
1  Princi   24     Kanpur            MA         91
2  Gaurav   22  Allahabad           MCA         58
3    Anuj   32    Kannuaj           Phd         76

      Name  Age    Address Qualification  Salary
2  Gaurav   22  Allahabad           MCA    1000
3    Anuj   32    Kannuaj           Phd    2000
6  Dhiraj   12  Allahabad          Bcom    3000
7  Hitesh   52    Kannuaj        B.hons    4000

In [99]:
# Now we set axes join = inner for intersection of dataframe
# applying concat with axes join = 'inner'
res2 = pd.concat([dff, dff1] , axis=1, join='inner')
res2

,Name,Age,Address,Qualification,Mobile No,Name,Age,Address,Qualification,Salary
2,Gaurav,22,Allahabad,MCA,58,Gaurav,22,Allahabad,MCA,1000
3,Anuj,32,Kannuaj,Phd,76,Anuj,32,Kannuaj,Phd,2000

In [100]:
# Now we set axes join = outer for union of dataframe.
# applying concat with axes join = 'outer'
res3 = pd.concat([dff, dff1], axis=1, join='outer')
res3

,Name,Age,Address,Qualification,Mobile No,Name,Age,Address,Qualification,Salary
0,Jai,27.0,Nagpur,Msc,97.0,NaN,NaN,NaN,NaN,NaN
1,Princi,24.0,Kanpur,MA,91.0,NaN,NaN,NaN,NaN,NaN
2,Gaurav,22.0,Allahabad,MCA,58.0,Gaurav,22.0,Allahabad,MCA,1000.0
3,Anuj,32.0,Kannuaj,Phd,76.0,Anuj,32.0,Kannuaj,Phd,2000.0
6,NaN,NaN,NaN,NaN,NaN,Dhiraj,12.0,Allahabad,Bcom,3000.0
7,NaN,NaN,NaN,NaN,NaN,Hitesh,52.0,Kannuaj,B.hons,4000.0

#### Concatenating DataFrame using .append()
In order to concat a dataframe, we use .append() function.\
this function concatenate along axis=0, namely the index. This function exist before .concat.

In [101]:
# using append function
res = cd.append(cd1)
res

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons

Note: It works like same as below

In [102]:
res= pd.concat([cd,cd1], axis=0)
res

# OR
# res= pd.concat([cd,cd1], axis=0 ,join='inner')
# res= pd.concat([cd,cd1], axis=0 ,join='outer')

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons

### 2. Merging DataFrame

In [103]:
# importing pandas module
import pandas as pd 
 
# Define a dictionary containing employee data 
data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32],} 
   
# Define a dictionary containing employee data 
data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']} 
 
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1)
 
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2) 
  
 
print(df, "\n\n", df1) 

merge = pd.merge(df, df1, how = 'left')
merge

  key    Name  Age
0  K0     Jai   27
1  K1  Princi   24
2  K2  Gaurav   22
3  K3    Anuj   32

   key    Address Qualification
0  K0     Nagpur         Btech
1  K1     Kanpur           B.A
2  K2  Allahabad          Bcom
3  K3    Kannuaj        B.hons

  key    Name  Age    Address Qualification
0  K0     Jai   27     Nagpur         Btech
1  K1  Princi   24     Kanpur           B.A
2  K2  Gaurav   22  Allahabad          Bcom
3  K3    Anuj   32    Kannuaj        B.hons

### 3. Joining Dataframe

In [104]:
# importing pandas module
import pandas as pd 
  
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32]} 
    
# Define a dictionary containing employee data 
data2 = {'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'], 
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons']} 
  
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=['K0', 'K1', 'K2', 'K3'])
  
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2, index=['K0', 'K2', 'K3', 'K4'])
 
 
print(df, "\n\n", df1) 

# joining dataframe
res = df.join(df1)
res

      Name  Age
K0     Jai   27
K1  Princi   24
K2  Gaurav   22
K3    Anuj   32

       Address Qualification
K0  Allahabad           MCA
K2    Kannuaj           Phd
K3  Allahabad          Bcom
K4    Kannuaj        B.hons

      Name  Age    Address Qualification
K0     Jai   27  Allahabad           MCA
K1  Princi   24        NaN           NaN
K2  Gaurav   22    Kannuaj           Phd
K3    Anuj   32  Allahabad          Bcom

In [105]:
# getting union
res1 = df.join(df1, how='outer')
res1

      Name   Age    Address Qualification
K0     Jai  27.0  Allahabad           MCA
K1  Princi  24.0        NaN           NaN
K2  Gaurav  22.0    Kannuaj           Phd
K3    Anuj  32.0  Allahabad          Bcom
K4     NaN   NaN    Kannuaj        B.hons

## 6. Python | Working with date and time using Pandas

In [106]:
today = pd.datetime.now()
today

/tmp/ipykernel_22961/3621269815.py:1: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  today = pd.datetime.now()

datetime.datetime(2023, 2, 21, 0, 45, 4, 639096)

##### Code #1: Create a dates dataframe

In [107]:
# Create dates dataframe with frequency 
date_df = pd.date_range('1/1/2011', periods = 6, freq ='H')
 
date_df

DatetimeIndex(['2011-01-01 00:00:00', '2011-01-01 01:00:00',
               '2011-01-01 02:00:00', '2011-01-01 03:00:00',
               '2011-01-01 04:00:00', '2011-01-01 05:00:00'],
              dtype='datetime64[ns]', freq='H')

##### Code #2: Create range of dates and show basic features

In [108]:
# Create date and time with dataframe
date_df = pd.date_range('1/1/2011', periods = 10, freq ='H')
 
x = pd.datetime.now()
x.month, x.year

/tmp/ipykernel_22961/1724712240.py:4: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  x = pd.datetime.now()

(2, 2023)

### Datetime features can be divided into two categories. The first one time moments in a period and second the time passed since a particular period. These features can be very useful to understand the patterns in the data.

##### Divide a given date into features – 

pandas.Series.dt.year  : returns the year of the date time.

pandas.Series.dt.month : returns the month of the date time. 

pandas.Series.dt.day   :returns the day of the date time.

pandas.Series.dt.hour  :returns the hour of the date time. 

pandas.Series.dt.minute :returns the minute of the date time.

##### Code #3: Break date and time into separate features

In [109]:
# Create date and time with dataframe
rng = pd.DataFrame()
rng['date'] = pd.date_range('1/1/2011', periods = 72, freq ='H')
 
# Print the dates in dd-mm-yy format
rng.head()   
#rng[0:5]

                 date
0 2011-01-01 00:00:00
1 2011-01-01 01:00:00
2 2011-01-01 02:00:00
3 2011-01-01 03:00:00
4 2011-01-01 04:00:00

In [110]:
# Create features for year, month, day, hour, and minute
rng['year'] = rng['date'].dt.year
rng['month'] = rng['date'].dt.month
rng['day'] = rng['date'].dt.day
rng['hour'] = rng['date'].dt.hour
rng['minute'] = rng['date'].dt.minute
 
# Print the dates divided into features
rng.head(3)

                 date  year  month  day  hour  minute
0 2011-01-01 00:00:00  2011      1    1     0       0
1 2011-01-01 01:00:00  2011      1    1     1       0
2 2011-01-01 02:00:00  2011      1    1     2       0

##### Code #4: To get the present time, use Timestamp.now() and then convert timestamp to datetime and directly access year, month or day.

In [111]:
# Input present datetime using Timestamp
t = pd.Timestamp.now()
t

Timestamp('2023-02-21 00:45:04.672966')

In [112]:
# Convert timestamp to datetime
t.to_datetime64()

numpy.datetime64('2023-02-21T00:45:04.672966000')

In [113]:
# Convert timestamp to pyhton datetime
t.to_pydatetime()

datetime.datetime(2023, 2, 21, 0, 45, 4, 672966)

In [114]:
# Directly access and print the features
t.year
t.month
t.day
t.hour
t.minute
t.second

4

In [115]:
# Let’s analyze this problem on a real dataset uforeports. 

import pandas as pd
 
url = 'http://bit.ly/uforeports'
 
# read csv file
ufo = pd.read_csv(url)          
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [116]:
# Convert the Time column to datetime format
ufo['Time'] = pd.to_datetime(ufo.Time)
 
ufo.head()

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00

In [117]:
# shows the type of each column data
ufo.dtypes

City                       object
Colors Reported            object
Shape Reported             object
State                      object
Time               datetime64[ns]
dtype: object

In [118]:
# Get hour detail from time data
ufo.Time.dt.hour.head()

0    22
1    20
2    14
3    13
4    19
Name: Time, dtype: int64

In [119]:
# Get name of each date
# ufo.Time.dt.weekday_name.head()

In [120]:
# Get name of each date
ufo.Time.dt.day_name().head()

0     Sunday
1     Monday
2     Sunday
3     Monday
4    Tuesday
Name: Time, dtype: object

In [121]:
# Get ordinal day of the year
ufo.Time.dt.dayofyear.head()

0    152
1    181
2     46
3    152
4    108
Name: Time, dtype: int64

### Python | Pandas Timestamp.timestamp
Pandas Timestamp.timestamp() function return the time expressed as the number of seconds that have passed since January 1, 1970. That zero moment is known as the epoch.


https://www.geeksforgeeks.org/python-pandas-timestamp-timestamp/

In [122]:
# Example 1: Use Timestamp.timestamp() function to return the number of seconds that
# has passed since the zero moment for the given Timestamp object.


# Create the Timestamp object
ts = pd.Timestamp(year = 2011,  month = 11, day = 21, 
                  hour = 10, second = 49, tz = 'US/Central') 
  
# Print the Timestamp object
print(ts)

2011-11-21 10:00:49-06:00

In [123]:
ts.timestamp()

1321891249.0

In [124]:
# Example 2
ts1 = pd.Timestamp(year = 2022, month = 11, day = 15,
                   hour = 8, minute = 40, second = 30, tz = 'Asia/Kolkata' )
print(ts1)

2022-11-15 08:40:30+05:30

In [125]:
ts1.timestamp()

1668481830.0

### Python | Pandas Timestamp.now
Pandas Timestamp.now() function return the current time in the local timezone. It is Equivalent to datetime.now([tz]).

https://www.geeksforgeeks.org/python-pandas-timestamp-now/

In [126]:
ts.now()

Timestamp('2023-02-21 00:45:06.431986')

### Python | Pandas Timestamp.isoformat
Pandas Timestamp.isoformat() function is used to convert the given Timestamp object into the ISO format.

https://www.geeksforgeeks.org/python-pandas-timestamp-isoformat/

In [127]:
print(ts)

2011-11-21 10:00:49-06:00

In [128]:
ts.isoformat()

'2011-11-21T10:00:49-06:00'

### Python | Pandas Timestamp.date

Pandas Timestamp.date() function return a datetime object with same year, month and day as that of the given Timestamp object.

https://www.geeksforgeeks.org/python-pandas-timestamp-date/

In [129]:
ts.date()

datetime.date(2011, 11, 21)

In [130]:
ts1.date()

datetime.date(2022, 11, 15)

### Python | Pandas Timestamp.replace

Pandas Timestamp.replace() function is used to replace the member values of the given Timestamp. The function implements datetime.replace, and it also handles nanoseconds.

https://www.geeksforgeeks.org/python-pandas-timestamp-replace/

In [131]:
ts.replace(year = 2012)  # it will not replace original ts

Timestamp('2012-11-21 10:00:49-0600', tz='US/Central')

In [132]:
print(ts)

2011-11-21 10:00:49-06:00

In [133]:
ts.replace(year = 2012, month = 12, hour = 12)

Timestamp('2012-12-21 12:00:49-0600', tz='US/Central')

### Python | Pandas.to_datetime()

When a csv file is imported and a Data Frame is made, the Date time objects in the file are read as a string object rather a Date Time object and Hence it’s very tough to perform operations like Time difference on a string rather a Date Time object. Pandas to_datetime() method helps to convert string Date time into Python Date time object.

In [134]:
# Example1: String to Date:

# In the following example, a csv file is read and the date column of Data frame is converted into 
# Date Time object from a string object.

cf = pd.read_csv("todatetime.csv")
cf

           Date      Time
0      8/6/1993  12:42 PM
1     3/31/1996   6:53 AM
2     4/23/1993  11:17 AM
3      3/4/2005   1:00 PM
4     1/24/1998   4:47 PM
..          ...       ...
995  11/23/2014   6:09 AM
996   1/31/1984   6:30 AM
997   5/20/2013  12:39 PM
998   4/20/2013   4:45 PM
999   5/15/2012   6:24 PM

[1000 rows x 2 columns]

In [135]:
cf.dtypes

Date    object
Time    object
dtype: object

In [136]:
# overwriting data after changing format
cf["Date"] = pd.to_datetime(cf["Date"])

In [137]:
# display
cf

          Date      Time
0   1993-08-06  12:42 PM
1   1996-03-31   6:53 AM
2   1993-04-23  11:17 AM
3   2005-03-04   1:00 PM
4   1998-01-24   4:47 PM
..         ...       ...
995 2014-11-23   6:09 AM
996 1984-01-31   6:30 AM
997 2013-05-20  12:39 PM
998 2013-04-20   4:45 PM
999 2012-05-15   6:24 PM

[1000 rows x 2 columns]

In [138]:
# info of data
cf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    1000 non-null   datetime64[ns]
 1   Time    1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [139]:
cf.dtypes

Date    datetime64[ns]
Time            object
dtype: object

In [140]:
# Example 2: Exception while converting Time:

# Time object can also be converted with this method. But since in the Time column, 
# a date isn’t specified and hence Pandas will put Today’s date automatically in that case.

tf = pd.read_csv("todatetime.csv")

# overwriting data after changing format
tf["Time"]= pd.to_datetime(tf["Time"])
  
# display
tf

           Date                Time
0      8/6/1993 2023-02-21 12:42:00
1     3/31/1996 2023-02-21 06:53:00
2     4/23/1993 2023-02-21 11:17:00
3      3/4/2005 2023-02-21 13:00:00
4     1/24/1998 2023-02-21 16:47:00
..          ...                 ...
995  11/23/2014 2023-02-21 06:09:00
996   1/31/1984 2023-02-21 06:30:00
997   5/20/2013 2023-02-21 12:39:00
998   4/20/2013 2023-02-21 16:45:00
999   5/15/2012 2023-02-21 18:24:00

[1000 rows x 2 columns]

In [141]:
# info of data
tf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    1000 non-null   object
 1   Time    1000 non-null   datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [142]:
tf.dtypes

Date            object
Time    datetime64[ns]
dtype: object

### Python | pandas.date_range() method

pandas.date_range() is one of the general functions in Pandas which is used to return a fixed frequency DatetimeIndex.

https://www.geeksforgeeks.org/python-pandas-date_range-method/

In [143]:
# code 1
per1 = pd.date_range(start ='1-1-2022', 
         end ='1-03-2022', freq ='5H')
  
for val in per1:
    print(val)

2022-01-01 00:00:00
2022-01-01 05:00:00
2022-01-01 10:00:00
2022-01-01 15:00:00
2022-01-01 20:00:00
2022-01-02 01:00:00
2022-01-02 06:00:00
2022-01-02 11:00:00
2022-01-02 16:00:00
2022-01-02 21:00:00

In [144]:
# code 2

dRan1 = pd.date_range(start ='1-1-2018',
           end ='8-01-2018', freq ='M')
  
dRan2 = pd.date_range(start ='1-1-2018', 
         end ='11-01-2018', freq ='3M')
  
print(dRan1, '\n\n', dRan2)

DatetimeIndex(['2018-01-31', '2018-02-28', '2018-03-31', '2018-04-30',
               '2018-05-31', '2018-06-30', '2018-07-31'],
              dtype='datetime64[ns]', freq='M')

 DatetimeIndex(['2018-01-31', '2018-04-30', '2018-07-31', '2018-10-31'], dtype='datetime64[ns]', freq='3M')

In [145]:
# code 3

# Specify start and periods, the number of periods (days).
dRan1 = pd.date_range(start ='1-1-2018', periods = 13)
  
# Specify end and periods, the number of periods (days).
dRan2 = pd.date_range(end ='1-1-2018', periods = 13)
  
# Specify start, end, and periods; the frequency 
# is generated automatically (linearly spaced).
dRan3 = pd.date_range(start ='01-03-2017', 
            end ='1-1-2018', periods = 13)
  
print(dRan1, "\n\n", dRan2, '\n\n', dRan3)

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08',
               '2018-01-09', '2018-01-10', '2018-01-11', '2018-01-12',
               '2018-01-13'],
              dtype='datetime64[ns]', freq='D')

 DatetimeIndex(['2017-12-20', '2017-12-21', '2017-12-22', '2017-12-23',
               '2017-12-24', '2017-12-25', '2017-12-26', '2017-12-27',
               '2017-12-28', '2017-12-29', '2017-12-30', '2017-12-31',
               '2018-01-01'],
              dtype='datetime64[ns]', freq='D')

 DatetimeIndex(['2017-01-03 00:00:00', '2017-02-02 06:00:00',
               '2017-03-04 12:00:00', '2017-04-03 18:00:00',
               '2017-05-04 00:00:00', '2017-06-03 06:00:00',
               '2017-07-03 12:00:00', '2017-08-02 18:00:00',
               '2017-09-02 00:00:00', '2017-10-02 06:00:00',
               '2017-11-01 12:00:00', '2017-12-01 18:00:00',
               '2018-01-01 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [146]:
# Code 4

# Specify start and periods, the number of periods (days).
dRan1 = pd.date_range(start ='1-1-2018', 
       periods = 13, tz ='Asia/Kolkata')
  
dRan1

DatetimeIndex(['2018-01-01 00:00:00+05:30', '2018-01-02 00:00:00+05:30',
               '2018-01-03 00:00:00+05:30', '2018-01-04 00:00:00+05:30',
               '2018-01-05 00:00:00+05:30', '2018-01-06 00:00:00+05:30',
               '2018-01-07 00:00:00+05:30', '2018-01-08 00:00:00+05:30',
               '2018-01-09 00:00:00+05:30', '2018-01-10 00:00:00+05:30',
               '2018-01-11 00:00:00+05:30', '2018-01-12 00:00:00+05:30',
               '2018-01-13 00:00:00+05:30'],
              dtype='datetime64[ns, Asia/Kolkata]', freq='D')